{
  "Title": "<p>Analysing Dynamic Data for MoCA Solo</p>\n",
  "Leaders": "<p>Murray Gilles: murray.gillies@mocacognition.com\nSaber Naderi: saber.naderi@mocacognition.com\nYijae Kim: yijae.kim@mocacognition.com / Discord handle: yijae1_42148_49872</p>\n",
  "Collaborators": "<p>Émile Dusablon Dion: emile.dusablondion@mocacognition.com / Discord handle: emile_98830\nJack Tacchi: jack.tacchi@osedea.com\nWalid Masoudimansour: walid.masoudimansour@osedea.com</p>\n",
  "Project Description": "<p>MoCA Cognition has developed a new digital tool called MoCA Solo to quantify a patient’s cognitive performance. It is based on the very well-established paper test “MoCA 8.1”, used to assess people with Mild Cognitive Impairment and Alzheimer’s disease. It requires the patient to perform an array of tasks, such as clock drawing, naming animals or recalling 5 words. For the paper version, a point is awarded for each task, but how the task is completed can only be observed live by a human. In the MoCA Solo application, all data is recorded in raw format, i.e. all audio files and every click on the iPad are collected for post data collection analysis.</p>\n<p>MoCA Cognition has collected data with the MoCA Solo application from 500 English-speaking participants, including patients and healthy individuals. All the current outcome measures have been annotated by three human raters. MoCA Cognition has used this data to develop AI scoring algorithms to automatically score the current outcome measures without the need for the presence of a human. These scores characterize the patient and the goal of this activity was to reproduce the paper MoCA score.</p>\n<p>While the current outcome measures are available from both the algorithms and the ground truths for the 500 people, we haven’t explored the dynamics of how the MoCA Solo tests were completed. We are interested in whether there is information in the dynamics of how the tests are completed which correlates with the existing outcome measures. An example of this could be the time it takes for a patient to name an animal shown in an image and the ability to recall the 5 words in delayed recall. The goal of the project is to create algorithms that take the dynamic data and find features that correlate with the existing measures such as the MoCA Score.</p>\n<p>Demo video of MoCA Solo: https://youtu.be/sl_4nr-n8SM\nMoCA Paper 8.1 &amp; Instructions : https://captiva.neurosurgery.ufl.edu/resources/moca/</p>\n",
  "Link to project repository/sources": null,
  "Goals for Brainhack Montreal": "<p>The main goal of this project is to create algorithms that take the dynamic data from MoCA Solo and find features that correlate with the existing measures such as the MoCA Score.</p>\n<p>Detailed sub-goals will be defined and added closer to the hackathon date.</p>\n",
  "Skills": "<ul>\n<li>Data science &amp; analysis</li>\n<li>Programming (Python or R)</li>\n<li>Machine learning / algorithm development</li>\n<li>Neuropsychology / Cognitive science (not mandatory, but nice to have)</li>\n</ul>\n",
  "Tech stack": "<ul>\n<li>Python Programming language</li>\n<li>Python data libraries</li>\n<li>Machine learning libraries (scikit-learn, etc.)</li>\n</ul>\n",
  "Onboarding documentation / Expectations": null,
  "What will participants learn?": "<ul>\n<li>Feature engineering from dynamic cognitive task data</li>\n<li>Correlation analysis</li>\n<li>Algorithm development</li>\n<li>Interdiciplinary thinking</li>\n<li>Collaboration in a real research workflow</li>\n</ul>\n",
  "Data to use": "<p>Some aspects of the dataset like access method are still being finalized. These details will be added here prior to the event.</p>\n",
  "Credit to collaborators": null,
  "Image": null,
  "Type": "<p>coding_methods</p>\n",
  "Project Maturity Status": "<p>2 - releases existing</p>\n",
  "Topic": "<p>statistical_modelling</p>\n",
  "Tools": "<p>Jupyter</p>\n",
  "Programming language": "<p>Python</p>\n",
  "Modalities": "<p>not_applicable</p>\n",
  "Git skills": "<p>1_commit_push</p>\n",
  "Anything else?": null,
  "Things to do after the project is submitted and ready to review.": "<ul>\n<li>[x] Short summary of your project pitch to present during the hackathon.</li>\n</ul>\n",
  "issue_number": "7"
}