{
  "Title": "<p>HyPyP Cookbook Sprint: a community-driven onboarding kit (docs, tutorials, examples, and small feature fixes)</p>\n",
  "Leaders": "<ul>\n<li>Rémy Ramadour</li>\n<li>Patrice Fortin (waiting list)</li>\n</ul>\n",
  "Collaborators": "<ul>\n<li>Vincent Chamberland</li>\n<li>Nadine Mohamed</li>\n<li>Mariem Hafsia</li>\n<li>Saskia Helbling (waiting list)</li>\n<li>Anne Monnier (waiting list)</li>\n<li>Anaïs Rourre (waiting list)</li>\n</ul>\n",
  "Project Description": "<p>HyPyP is an open-source Python toolbox for hyperscanning and interpersonal brain/physiology synchrony analyses. The goal of this BrainHack project is to build a community-driven onboarding kit that makes HyPyP easier to learn, run, and extend—especially for newcomers.</p>\n<p>Concretely, we will produce a Cookbook: a small set of well-documented, reproducible tutorials (notebooks), improved documentation, and contributor-friendly entry points (“good first issues”). This will help students, researchers, and engineers quickly go from “I installed HyPyP” to “I can run a complete synchrony workflow and understand what I’m doing,” while also making it easier for new contributors to participate.</p>\n<p>As part of the Cookbook effort, we will also identify the main bottlenecks and roadblocks that create friction for newcomers (installation issues, unclear steps, common pitfalls) and either remove them when feasible or document clear solutions (troubleshooting/FAQ).</p>\n<p>This is a high-impact, low-friction community effort: in only a few days, we can significantly reduce the barrier to entry for hyperscanning analyses and improve reproducibility. The project is designed to be inclusive: contributors can help through writing, reviewing, coding, testing, visualization, or pedagogy, at beginner/intermediate/advanced levels.</p>\n<p>Bonus: if time allows, we’ll implement a small “quality-of-life” improvement (e.g., clearer API wrapper, tests, example dataset, or minor feature fix) so the event yields both documentation and code improvements.</p>\n<p>Participants will:</p>\n<ul>\n<li>clone the repo, install dependencies, and run a “hello world” notebook,</li>\n<li>pick a task (tutorial writing, doc improvement, tests/CI, visualization, small feature),</li>\n<li>submit contributions via PRs using templates and “good first issues” labels.</li>\n</ul>\n<p>We will provide a clear README, a beginner-friendly checklist, and a live coordination channel during the event.</p>\n",
  "Link to project repository/sources": "<p><a href=\"https://github.com/ppsp-team/HyPyPCookbook\">https://github.com/ppsp-team/HyPyPCookbook </a></p>\n",
  "Goals for Brainhack Montreal": "<p><strong>Milestone 1 — “Onboarding Kit” baseline (Day 1)</strong></p>\n<p><strong><em>Deliverables</em></strong></p>\n<ul>\n<li>A refreshed Quickstart in README: install, minimal example, expected output.</li>\n<li>A Cookbook skeleton: folder structure + table of contents.</li>\n<li>At least 5 “good first issues” ready to pick.</li>\n<li>A first pass “Friction log” (list of newcomer bottlenecks/roadblocks + proposed fixes or documentation links).</li>\n</ul>\n<p><strong><em>Beginner-friendly tasks</em></strong></p>\n<ul>\n<li>Rewrite/install troubleshooting (macOS/Windows/Linux, conda/poetry/pip).</li>\n<li>Add a glossary page: key concepts + links.</li>\n<li>Report friction points while onboarding (what broke / what was unclear) and propose wording fixes.</li>\n</ul>\n<p><strong><em>Intermediate tasks</em></strong></p>\n<ul>\n<li>Add a minimal simulated dataset and a script/notebook that runs end-to-end.</li>\n<li>Add CI smoke test: “import + run minimal pipeline”.</li>\n</ul>\n<p><strong>Milestone 2 — Tutorials that run end-to-end (Day 2)</strong></p>\n<p><strong><em>Deliverables</em></strong></p>\n<ul>\n<li>2–3 runnable notebooks with expected outputs saved (figures/tables):</li>\n<li>Hello synchrony (simulated signals → compute synchrony metrics)</li>\n<li>EEG hyperscanning minimal (MNE preprocessing → HyPyP metrics)</li>\n<li>Stats &amp; surrogates (permutation/surrogate testing + interpretation)</li>\n<li>Optional: a short notebook section or mini-notebook for common group stats (t-test / ANOVA) on synchrony outputs.</li>\n</ul>\n<p><strong><em>Beginner tasks</em></strong></p>\n<ul>\n<li>Improve narrative: explanations, figures, “what to check if results look wrong”.</li>\n<li>Add docstrings / examples to 2–3 public functions.</li>\n</ul>\n<p><strong><em>Intermediate tasks</em></strong></p>\n<ul>\n<li>Add unit tests for one tutorial pipeline (golden outputs / shape checks).</li>\n<li>Add a “common pitfalls” page (filtering, alignment, edge effects, leakage).</li>\n<li>Turn top friction items into fixes or documented solutions (FAQ / troubleshooting entries).</li>\n</ul>\n<p><strong><em>Advanced tasks</em></strong></p>\n<ul>\n<li>Identify and fix one small “paper cut” in the API (naming, defaults, error messages).</li>\n<li>Optional: add a small feature/wrapper improving usability, with tests + docs.</li>\n</ul>\n<p><strong>Milestone 3 — Integration &amp; demo-ready output (Day 3)</strong></p>\n<p><strong><em>Deliverables</em></strong></p>\n<ul>\n<li>A single BrainHack Demo Notebook that runs in &lt;10 minutes.</li>\n<li>A short “How to contribute” page + contributor credit instructions.</li>\n<li>A short report: what was improved, what remains, next steps.</li>\n<li>A consolidated “Friction log” summary (top bottlenecks + resolutions / workarounds).</li>\n</ul>\n<p><strong><em>Quality bar</em></strong></p>\n<ul>\n<li>Everything runs from a clean environment (fresh install) using the Quickstart.</li>\n<li>PRs merged, issues triaged, next milestones listed for after the event.</li>\n</ul>\n",
  "Skills": "<p><strong>Beginner (no coding required)</strong></p>\n<ul>\n<li>Technical writing / pedagogy: rewriting documentation, improving clarity, adding step-by-step explanations.</li>\n<li>Example tasks: improve the Quickstart, write a glossary, add a “common pitfalls” page.</li>\n<li>User testing / QA: installing HyPyP from scratch and reporting friction points.</li>\n<li>Example tasks: test installation on macOS/Windows/Linux, write an install checklist, propose fixes.</li>\n<li>Scientific curation: collecting references and mapping “concepts → HyPyP functions”.</li>\n<li>Example tasks: create a “recommended readings” page with short annotations.</li>\n</ul>\n<p><strong>Intermediate (Python)</strong></p>\n<ul>\n<li>Jupyter notebooks &amp; reproducibility: writing runnable tutorials with expected outputs (figures/tables).</li>\n<li>Example tasks: build “Hello synchrony” and “Stats &amp; surrogates” notebooks.</li>\n<li>EEG basics / data handling: working with MNE objects, basic preprocessing, aligning multi-person recordings.</li>\n<li>Example tasks: minimal MNE → HyPyP pipeline notebook.</li>\n<li>Tooling: environments, dependency management, documentation structure.</li>\n<li>Example tasks: improve install instructions, add a minimal example dataset for tutorials.</li>\n</ul>\n<p><strong>Advanced (engineering / methods)</strong></p>\n<ul>\n<li>Software engineering: unit tests, CI, refactoring, typing, code review.</li>\n<li>Example tasks: add tests for core functions, set up GitHub Actions smoke tests.</li>\n<li>Signal processing &amp; statistics: surrogates/permutation tests, circular stats, leakage control.</li>\n<li>Example tasks: validate a tutorial pipeline statistically; document interpretation guidelines.</li>\n<li>Small feature fixes (optional): minor API/UX improvements that remove “paper cuts”.</li>\n<li>Example tasks: clearer error messages, input validation, small wrapper functions with tests.</li>\n</ul>\n<p><strong>Bonus (non-coding but very valuable)</strong></p>\n<ul>\n<li>Visualization &amp; communication: figures, diagrams, short demo slides.</li>\n<li>Project coordination: issue triage, labels, PR templates, maintaining a project board.</li>\n</ul>\n",
  "Tech stack": "<p><strong>Core language &amp; ecosystem</strong></p>\n<ul>\n<li>Python 3.x</li>\n<li>HyPyP (main target project): hyperscanning / interpersonal synchrony toolbox</li>\n</ul>\n<p><strong>Scientific computing</strong></p>\n<ul>\n<li>NumPy / SciPy: core numerical operations</li>\n<li>MNE-Python (for EEG-focused tutorials): data structures, basic preprocessing, examples</li>\n<li>Matplotlib (and/or existing HyPyP plotting utilities): figures for tutorials and demos</li>\n<li>(Optional, if already in HyPyP deps/workflow) Pandas for tidy tutorial outputs</li>\n</ul>\n<p><strong>Documentation &amp; tutorials</strong></p>\n<ul>\n<li>Jupyter Notebooks: executable tutorials (“Cookbook”)</li>\n<li>Markdown: README, Quickstart, glossary, troubleshooting, contributor docs</li>\n<li>(Optional, depending on current repo tooling) MkDocs or Sphinx for structured docs</li>\n</ul>\n<p><strong>Engineering &amp; collaboration</strong></p>\n<ul>\n<li>Git + GitHub: issues, pull requests, review workflow</li>\n<li>GitHub Actions (CI): smoke tests (import + run minimal pipeline), unit tests</li>\n<li>pytest: unit tests</li>\n<li>pre-commit (optional): formatting/lint checks</li>\n</ul>\n",
  "Onboarding documentation / Expectations": "<p>We will use a dedicated BrainHack branch for the sprint work, and provide clear contribution guidelines.</p>\n<p>Planned onboarding assets (in the HyPyP repo):</p>\n<ul>\n<li>CONTRIBUTING.md (on the BrainHack branch):</li>\n<li>how to set up the environment</li>\n<li>how to run tests / notebooks</li>\n<li>coding style expectations (lightweight)</li>\n<li>how to open a PR, review process, and how we credit contributions</li>\n<li>BrainHack Sprint README section (or docs/brainhack.md):</li>\n<li>project goals and day-by-day plan</li>\n<li>“pick a task” menu (beginner → advanced)</li>\n<li>links to “good first issues”</li>\n<li>Issue labels + templates: good first issue, documentation, tutorial, tests, help wanted</li>\n</ul>\n<p>How to join and start contributing (during the event)</p>\n<ol>\n<li>Join the project communication channel (link will be shared in the README).</li>\n<li>Clone the repo and check out the BrainHack branch.</li>\n<li>Run the Quickstart notebook/script to validate your setup.</li>\n<li>Pick an issue (or propose one), then open a PR early (even as draft) for feedback.</li>\n</ol>\n",
  "What will participants learn?": "<p><strong>Beginner outcomes (no coding required)</strong></p>\n<ul>\n<li>How hyperscanning / interpersonal synchrony projects are typically structured (data → preprocessing → synchrony metrics → stats → interpretation).</li>\n<li>How to read and improve open-source scientific documentation effectively (Quickstart, troubleshooting, glossary).</li>\n<li>How to contribute to a research software project via GitHub issues and pull requests (even for non-code contributions).</li>\n</ul>\n<p><strong>Intermediate outcomes (Python + notebooks)</strong></p>\n<ul>\n<li>How to run a complete, reproducible HyPyP pipeline using notebooks.</li>\n<li>How to work with typical hyperscanning data structures (multi-person time series, alignment, basic preprocessing).</li>\n<li>How to generate clear figures and “expected outputs” that make analyses easier to verify and teach.</li>\n</ul>\n<p><strong>Advanced outcomes (engineering + methods)</strong></p>\n<ul>\n<li>How to add unit tests and CI checks to scientific Python codebases without slowing research iteration.</li>\n<li>Best practices for reproducibility in computational neuroscience (minimal datasets, deterministic outputs, versioned tutorials).</li>\n<li>Deeper understanding of synchrony statistics (surrogates/permutations, circular measures, leakage pitfalls) and how to document interpretation.</li>\n</ul>\n<p><strong>Bonus outcomes (for everyone)</strong></p>\n<ul>\n<li>Practical experience in collaborative open science: task breakdown, review, crediting contributions, and producing demo-ready outputs in a short sprint.</li>\n</ul>\n",
  "Data to use": "<p>We will provide a small dataset on Day 1 of the event to support reproducible tutorials and testing. The dataset will be shared via the project repository (or a linked public folder) and will be accompanied by a minimal “expected outputs” notebook so contributors can validate their setup quickly.</p>\n",
  "Credit to collaborators": "<p>We will credit contributions openly and consistently:</p>\n<ul>\n<li>All contributions will happen via GitHub issues and pull requests, so each contributor’s work is traceable.</li>\n<li>We will maintain a Contributors section in the project documentation (README or a dedicated page) listing names and contribution types (docs, tutorials, code, testing, review, coordination).</li>\n<li>Where appropriate, we will use the all-contributors format (or an equivalent simple table) to acknowledge non-code contributions equally (documentation, QA, design, project management).</li>\n<li>Contributors who actively participate during the event will be acknowledged in the final BrainHack wrap-up materials (demo/report), by name.</li>\n</ul>\n",
  "Image": "<p><img src=\"https://github.com/user-attachments/assets/ae12a177-893f-403b-8b82-932cac8916a1\" alt=\"Image\" /></p>\n",
  "Type": "<p>documentation</p>\n",
  "Project Maturity Status": "<p>1 - basic structure</p>\n",
  "Topic": "<p>other</p>\n",
  "Tools": "<p>MNE</p>\n",
  "Programming language": "<p>Python</p>\n",
  "Modalities": "<p>EEG</p>\n",
  "Git skills": "<p>1_commit_push</p>\n",
  "Anything else?": null,
  "Things to do after the project is submitted and ready to review.": "<ul>\n<li>[ ] Short summary of your project pitch to present during the hackathon.</li>\n</ul>\n",
  "issue_number": "5"
}