{
  "Title": "<p>FPGA Hardware Acceleration of 3D reconstruction of EEG data</p>\n",
  "Leaders": "<p>Hossen Alyazgi — hossenalyazgi@mail.mcgill.ca — cristo07847</p>\n",
  "Collaborators": null,
  "Project Description": "",
  "What is being done, for whom, and why?": "<p>This project will aim to apply Hardware Acceleration to the algorithims responsible for the 3D-reconsttruction of EEG signals from the <a href=\"https://neuroimage.usc.edu/brainstorm/Introduction\">BRAINSTORM</a> Software (<a href=\"https://github.com/brainstorm-tools/brainstorm3\">GitHub repo</a>).</p>\n<p>This hopes to be a Proof of Concept for opening further research avenues into the topic of Closed-Loop Neuromodulation. State-Dependent Neuromodulation requires Real-time feedback of neural signal responses to stimulation, which an FPGA would enable. Initially, this 3D reconstruction could be used to visualize EEG responses in real time for research or clinical use.</p>\n<p>Ultimately, the idea however is to leverage the generated topography of 3D EEG activity for use as a structural &quot;prior&quot; to be then fed into Deep-Learning models for extrapolation or inferring connections based on eeg data.</p>\n<p>For the BRAINSTORM Project Itself, there have been discussion threads from users who are looking for real time processing options:\n<a href=\"https://neuroimage.usc.edu/forums/t/where-do-i-find-the-option-to-connect-brainstorm-to-a-live-eeg-amplifier/50239\">Where do I find the option to connect Brainstorm to a live EEG amplifier? (2025)</a>\n<a href=\"https://neuroimage.usc.edu/forums/t/real-time-processing-in-brain-storm/1286\">Real Time Processing in Brain storm (2014)</a>\nso there is a desire to have such functionality available. Further reading and research is available in the repo wiki (TBD)</p>\n",
  "What makes the project special and exciting?": "<p>Multimodal neuroimaging is a very exciting domain of research. Electroencephalography (EEG), Magnetoencephalography (MEG), and Functional Near-Infrared Spectroscopy (fNIRS) are noninvasive imaging techniques which all have very high temporal resolution (temporal = high sample rate, which can better be correlated with brain activity) but low spatial resolution (we can't pinpoint as precisely where the signals are coming from as compared to an MRI for example). Combining these imaging techniques, however, results in a fuller picture of what is going on in the brain. This takes the form of using post-processing software and toolboxes such as BRAINSTORM. This however is done <em>after the fact</em>.</p>\n<p>The idea behind between accelerating computation of these data processing techniques is to open further possibilites for research and clinical domains, and allow for further vectors of analysis. Normally, the use of integrated circuits and FPGA's in neural processing occurs with invasive methodologies, but for noninvasive approaches this is still type of approach is still open for exploration.</p>\n",
  "How to get started?": "<p>The project is going to be implemented on a DE1-SoC development board. The tentative outline for what needs to be done is on the GitHub ReadMe and will be updated. The plan is to divide work into isolated &quot;chunks&quot; with well defined input -&gt; output files/format and expectations for datatypes and other metrics so that contributors can make their own unit tests and verify functionality</p>\n",
  "Where to find key resources?": "<p>In the GitHub repo (specific locations TBD will be included in ReadMe</p>\n",
  "Link to project repository/sources": "<p>https://github.com/balzacbabylon/neuro-rtl</p>\n",
  "Goals for Brainhack Montreal": "<p>Note: this structure and goals are tentative and subject to change. In particular, the method for vizualization might change as details of the implementation are ironed out.</p>\n",
  "Day 1: Basic Opeation and Data Pipeline": "<p><strong>Goal: Get data flowing from PC to the board and verify the math in software.</strong>\nBeginner Contributors (Data Prep):</p>\n<ul>\n<li>Task: Install Brainstorm on a laptop. Export the ImagingKernel and a sample EEG recording.</li>\n<li>Task: Write a Python/Matlab script to &quot;simulate&quot; the FPGA: Load the EEG data, multiply by the matrix, and verify the result. This creates the &quot;Golden Vectors&quot; for testing.</li>\n</ul>\n<p>Intermediate Contributors (Linux):</p>\n<ul>\n<li>Task: Flash the DE1-SoC SD card with Linux. Get SSH working.</li>\n<li>Task: Write a simple C program on the HPS (ARM) that reads a dummy binary file and prints it to the terminal.</li>\n</ul>\n<p>Advanced Contributors (Quartus):</p>\n<ul>\n<li>Task: Set up the Qsys project. Instantiate the HPS system, the SDRAM controller, and a basic LED PIO (Parallel I/O) to prove the HPS can blink an FPGA LED.</li>\n</ul>\n",
  "Day 2: Core Logic": "<p><strong>Goal: Implement the math on hardware and establish the visualization.</strong>\nBeginner Contributors (Visualization):</p>\n<ul>\n<li>Task: Write the Matlab UDP listener. Make a 3D brain mesh light up with random colors to prove the graphics pipeline works.</li>\n</ul>\n<p>Intermediate Contributors (Bridge):</p>\n<ul>\n<li>Task: Expand the C program. Map the HPS-to-FPGA Lightweight Bridge.</li>\n<li>Task: Write the code to &quot;feed&quot; the FPGA: Push one vector of EEG data into a FIFO every 2ms.</li>\n</ul>\n<p>Advanced Contributors (DSP):</p>\n<ul>\n<li>Task: Write the Verilog for the Matrix-Vector Multiplier.</li>\n<li>Task: Implement the State Machine</li>\n<li>Constraint: Get the design to compile and fit in the FPGA.</li>\n</ul>\n",
  "Day 3: Integration": "<p><strong>Goal: Merge independent subsystems into a closed loop (Data → HPS → FPGA → HPS → PC).</strong>\nBeginner Contributors (Data &amp; Visualization)</p>\n<ul>\n<li>Task: Ensure the visualization on the PC accurately reflects the data sent by the board.</li>\n<li>Task: Hardcode a static &quot;Test Pattern&quot; (e.g., Scout 1 = 100%, others = 0%) in the receiving script. Verify that the correct anatomical region lights up before connecting to the live stream.</li>\n</ul>\n<p>Intermediate Contributors (Software &amp; Transport)</p>\n<ul>\n<li>Task: Guarantee data integrity between the HPS (ARM) and the PC. Ensure that the UDP packets arrive in the correct order and with the correct byte alignment</li>\n<li>Task: Use tcpdump or Wireshark to prove packets are leaving the board at the correct rate (500Hz). Confirm the payload size matches exactly 68×4 bytes (plus header).</li>\n</ul>\n<p>Advanced Contributors (FPGA &amp; Hardware)</p>\n<ul>\n<li>Task: Prove the FPGA is actually doing the work. The output from the hardware registers must match the &quot;Golden Vectors&quot; (simulated results) exactly.</li>\n<li>Task: manually write a single input vector to the FPGA and read the result. Compare this static result against the calculated value from Day 1 to sign off on hardware accuracy.</li>\n</ul>\n",
  "Skills": "",
  "Skill Requirements & Prerequisites": "<p>| Skill Domain | Beginner | Intermediate | Advanced |\n|--------|--------|--------|--------|\n| FPGA / HDL | Understanding of logic gates, binary math | Verilog/VHDL syntax, Finite State Machines (FSM) | AXI Bus protocols, DSP slice optimization |\n| Software | Python (NumPy), Matlab basics | C/C++ (Pointers, structs), Linux basics | Embedded Linux (drivers, mmap), Multi-threading, Network programming |\n| Neuroscience | Basic anatomy (lobes of the brain) | Understanding of EEG arrays (10-20 system) | Inverse problems (MNE), Coordinate systems (MNI vs. SCS) |\n| Tools | Git, SSH, VS Code | Intel Quartus (Basic flow), Qsys/Platform Designer | SignalTap Logic Analyzer, ModelSim/Questasim |</p>\n",
  "Tech stack": "<ol>\n<li>Hardware Layer</li>\n</ol>\n<p>Development Board: Terasic DE1-SoC (Cyclone V SoC).</p>\n<p>FPGA Fabric: Intel Cyclone V 5CSEMA5 (85K Logic Elements, 4,450 Kbits Embedded Memory, 87 DSP Blocks).</p>\n<p>Hard Processor System (HPS): Dual-Core ARM Cortex-A9 MPCore (running at ~800 MHz).</p>\n<p>Memory:</p>\n<p>FPGA: On-Chip M10K Blocks (BRAM) for storing the ImagingKernel and Lookup Tables.</p>\n<p>HPS: 1GB DDR3 SDRAM (Shared via AXI bridges if needed).</p>\n<p>Peripherals:</p>\n<p>Ethernet (RJ45): For UDP streaming to the Host PC.</p>\n<p>SD Card: Boot medium for Linux and storage for the EEG recording file.</p>\n<ol start=\"2\">\n<li>FPGA Design Layer</li>\n</ol>\n<p>IDE / Synthesis: Intel Quartus Prime Lite Edition (v18.1 or later recommended).</p>\n<p>System Integration: Platform Designer (for connecting the ARM processor to the FPGA logic via AXI bridges)</p>\n<p>HDL Language: SystemVerilog</p>\n<p>IP Cores (Intel Library):</p>\n<p>Altera PLL: To generate system clocks.</p>\n<p>On-Chip Memory (RAM or ROM): Dual-port configuration.</p>\n<p>FIFO: For buffering data between HPS and FPGA.</p>\n<p>Simulation: ModelSim</p>\n<ol start=\"3\">\n<li>Embedded Software Layer</li>\n</ol>\n<p>Operating System: Linux</p>\n<p>Language: C/C++ (standard GCC toolchain arm-linux-gnueabihf).</p>\n<p>Key Libraries:</p>\n<p>mman.h: For memory mapping (mmap) physical addresses to user space (to talk to the FPGA).</p>\n<p>sys/socket.h: For creating the UDP socket.</p>\n<p>pthread.h: Seperate threads for FPGA/network data communication</p>\n<p>Drivers: Standard Linux /dev/mem interface</p>\n<ol start=\"4\">\n<li>Host PC Layer</li>\n</ol>\n<p>Core Software: Brainstorm3 (running on MATLAB).</p>\n<p>Scripting: MATLAB</p>\n<p>Networking: Standard UDP Socket listeners.</p>\n<p>Data Formats:</p>\n<p>Input: .bst / .mat (Brainstorm native files).</p>\n<p>Intermediary: Binary .bin (Fixed-point Q15.16 format for the DE1-SoC).</p>\n<ol start=\"5\">\n<li>Communication &amp; Protocols</li>\n</ol>\n<p>Internal Bus (SoC):</p>\n<p>AXI-Lightweight Bridge: For Control Signals (HPS → FPGA: &quot;Start&quot;, &quot;Stop&quot;, &quot;Threshold&quot;).</p>\n<p>AXI-H2F Bridge: For high-throughput Data Streaming (HPS → FPGA FIFO).</p>\n<p>External Network:</p>\n<p>UDP/IP: For low-latency streaming of the 68-element source vector from the Board to the PC.</p>\n<p>SSH: For deploying code and debugging the Linux application.</p>\n<ol start=\"6\">\n<li>Development &amp; Debugging Tools</li>\n</ol>\n<p>Version Control: Git (GitHub).</p>\n<p>Hardware Debugger: SignalTap II Logic Analyzer (Part of Quartus) – Essential for seeing what is happening inside the FPGA wires while it runs.</p>\n<p>Network Analyzer: Wireshark or tcpdump – To verify packet structure and timing.</p>\n<p>Command Line: Bash (for scripting the Linux build process on the DE1-SoC).</p>\n",
  "Onboarding documentation / Expectations": "<p>Onboarding instructions can be found in the repo CONTRIBUTING.md (to be created) in the wiki.\nExpectations for team members depends on how much you want to commit. If you commit to contribute a lot of work then there will be big blocks of the project assigned to you.</p>\n",
  "What will participants learn?": "<p>Depending on which aspect of the project you work on, you will learn a variety of things. Here is a breakdown of what learning outcomes can be expected for each aspect of the project:</p>\n<p>Learning Outcomes</p>\n<p>Beginner:</p>\n<p>How to interface a PC with an embedded system (Host-Target communication).</p>\n<p>Basics of 3D medical data (vertices, faces, regions of interest).</p>\n<p>How to write a UDP listener for real-time data visualization.</p>\n<p>Intermediate:</p>\n<p>The &quot;SoC Flow&quot;: How an ARM processor talks to FPGA fabric (HPS-to-FPGA bridges).</p>\n<p>Memory mapping: Controlling hardware registers from C code.</p>\n<p>Fixed-point arithmetic: Converting float to int for hardware efficiency.</p>\n<p>Advanced:</p>\n<p>Designing a custom Matrix-Vector Multiplier (MVM) accelerator.</p>\n<p>Optimizing memory bandwidth and handling FIFO streams.</p>\n<p>End-to-end system latency analysis and optimization.</p>\n",
  "Data to use": "<p>We intend to use Open-Source EEG recording data, which will be TBD</p>\n",
  "Credit to collaborators": "<p>Project contributors are listed on the project README using [all-contributors github bot] (https://github.com/all-contributors/all-contributors).</p>\n",
  "Image": "<p><img src=\"https://github.com/user-attachments/assets/085264b3-8dd0-473e-9373-21da4ce4783c\" alt=\"Image\" /></p>\n",
  "Type": "<p>visualization</p>\n",
  "Project Maturity Status": "<p>1 - basic structure</p>\n",
  "Topic": "<p>EEG_source_modelling</p>\n",
  "Tools": "<p>FieldTrip</p>\n",
  "Programming language": "<p>other</p>\n",
  "Modalities": "<p>EEG</p>\n",
  "Git skills": "<p>1_commit_push, 2_branches_PRs</p>\n",
  "Anything else?": null,
  "Things to do after the project is submitted and ready to review.": "<ul>\n<li>[x] Short summary of your project pitch to present during the hackathon.</li>\n</ul>\n",
  "issue_number": "4"
}