{
  "Title": "<p>Build a Python command line configuration wizard for Neurobagel</p>\n",
  "Leaders": "<p>Sebastian Urchs (_surchs)\nAlyssa Dai (daialyssa)\nArman Jahanpour (rmanaem)</p>\n",
  "Collaborators": null,
  "Project Description": "<p><a href=\"https://neurobagel.org/\">Neurobagel</a> is a tool ecosystem and network of global data nodes that lets you search for subject-level neuroscience cohorts across distributed datasets stored at other institutes or sites. To participate, institutes deploy local Neurobagel “nodes” that then connect to the global network to become discoverable and queryable.</p>\n<p>We want to make it easier to deploy a Neurobagel node so that more sites can join Neurobagel, including those with more limited technical resources. Currently, configuring a Neurobagel node requires copying and editing local configuration files by hand. This configuration is important, because it controls options such as whether queries return aggregated results or full records, and other privacy-relevant settings.</p>\n<p>The current approach is cumbersome and overwhelming for users for several reasons:</p>\n<ul>\n<li>There are many config options, so the template file is long and hard to edit</li>\n<li>We are actively developing Neurobagel, so new config options are regularly introduced that users then must manually update in their existing setup</li>\n<li>Neurobagel has different deployment use cases, and many config options are only relevant to certain ones</li>\n<li>Users can only find out if their config files are correct by launching the node and waiting for it to fail</li>\n</ul>\n<p><strong>Our goal:</strong> To create a command line tool that will simplify the process of generating a valid configuration for a Neurobagel node.</p>\n<p><strong>Come talk to us if you:</strong></p>\n<ul>\n<li>Want to (learn to) build the command line tool with us</li>\n<li>and/or are interested in using Neurobagel and want to give us your view as a potential user\nWe are very excited for both kinds of contributions!</li>\n</ul>\n",
  "Link to project repository/sources": "<ul>\n<li>Project website: https://neurobagel.org/</li>\n<li>GitHub organization: https://github.com/neurobagel</li>\n<li>GitHub issue in the Neurobagel organization: https://github.com/neurobagel/recipes/issues/130</li>\n<li>The public Neurobagel query portal: https://query.neurobagel.org/</li>\n<li>Current template .env file: https://github.com/neurobagel/recipes/blob/main/template.env</li>\n</ul>\n",
  "Goals for Brainhack Montreal": "<ul>\n<li>Gather feedback from contributors to design a simple, user-friendly, and mostly automated process for providing configurations settings for a Neurobagel node via .env/config files</li>\n<li>Collaboratively develop an easy-to-use Python CLI tool that will simplify Neurobagel node setup by automatically generating a full deployment <code>.env</code> file</li>\n<li>The tool should:</li>\n<li>Parse and validate user-provided configuration values that explicitly override default settings</li>\n<li>Allow users to easily update an existing config with different values or newly supported variables</li>\n<li>Output a deployable configuration file for a Neurobagel node containing either default values or user-supplied values</li>\n</ul>\n",
  "Skills": "<p>As a user:</p>\n<ul>\n<li>Experience running Python-based tools or commands in the terminal</li>\n<li>Interest in making data discoverable</li>\n</ul>\n<p>As a developer (helpful, but not required):</p>\n<ul>\n<li>Python</li>\n<li>Terminal/Bash</li>\n</ul>\n<p>Nice to have:</p>\n<ul>\n<li>Docker</li>\n<li>Familiarity with Python command line input tools (e.g., <a href=\"https://typer.tiangolo.com/\">Typer</a> or <a href=\"https://docs.python.org/3/library/argparse.html\">argparse</a>)</li>\n<li>Git/GitHub</li>\n<li>We recommend creating a GitHub account if you don’t already have one</li>\n</ul>\n",
  "Tech stack": "<p>This BrainHack project will use the following tools:</p>\n<ul>\n<li>Python</li>\n<li><a href=\"https://typer.tiangolo.com/\">Typer</a></li>\n<li>Docker (not the main focus, previous experience not required)</li>\n</ul>\n",
  "Onboarding documentation / Expectations": "<p>You can find our code contribution guidelines here https://neurobagel.org/contributing/CONTRIBUTING/, but reading them isn’t required to get started - project leads will guide you through all steps of contributing!</p>\n",
  "What will participants learn?": "<ul>\n<li>How to build a standalone Python tool that takes user input on the command line</li>\n<li>How to set up and contribute to a GitHub repository step-by-step (fork -&gt; commit -&gt; push -&gt; pull request)</li>\n<li>How to write useful tests of key functions</li>\n<li>How to release and ship the finished tool so others can install it</li>\n<li>How to work with <code>.env</code> files for tool configuration</li>\n</ul>\n",
  "Data to use": null,
  "Credit to collaborators": "<ul>\n<li>Contributors will be included as co-authors on pull requests and will appear under the “Contributors” list of the GitHub repo</li>\n<li>We will mention contributors when we announce and distribute the tool to our network of nodes</li>\n</ul>\n",
  "Image": null,
  "Type": "<p>data_management</p>\n",
  "Project Maturity Status": "<p>2 - releases existing</p>\n",
  "Topic": "<p>other</p>\n",
  "Tools": "<p>other</p>\n",
  "Programming language": "<p>Python</p>\n",
  "Modalities": "<p>not_applicable</p>\n",
  "Git skills": "<p>1_commit_push</p>\n",
  "Anything else?": null,
  "Things to do after the project is submitted and ready to review.": "<ul>\n<li>[x] Short summary of your project pitch to present during the hackathon.</li>\n</ul>\n",
  "issue_number": "6"
}